# 题目描述：
# 给你一个整数list L, 如 L=[2,-3,3,50], 求L的一个连续子序列，使其和最大，输出最大子序列的和。
# 例如，对于L=[2,-3,3,50]，
# 输出53（分析：很明显，该列表最大连续子序列为[3,50]).
# 示例：
# 输入：L = [2, -3, 3, 50]
#
# 输出：53
L=[2,-3,3,50,12,-1,3]

# --------------method-1----------------
# s = 0
# ans = 0
# for i in L:
#     if s > 0:
#         s += i
#     else:
#         s = i
#     ans = max(ans, s)
# print(ans)

# ------------------method-2-------------------
res = -1000000
tmp = -1000000
for num in L:
    tmp = max(tmp+num, num)
    res = max(res, tmp)
print(res)
